lkolbly/cmsis-svd/data/TexasInstruments/LM3S2919.svd
<?xml version="1.0" encoding="UTF-8"?>

<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd" >
  <name>LM3S2919</name>
  <version>7944</version>
  <description>ARM Cortex-M3 Stellaris Device</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <resetMask>0</resetMask>
  <peripherals>
    <peripheral>
      <name>WATCHDOG0</name>
      <description>Register map for WATCHDOG0 peripheral</description>
      <groupName>WATCHDOG</groupName>
      <prependToName>WATCHDOG0</prependToName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LOAD</name>
          <description>Watchdog Load</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>WDT_LOAD</name>
              <description>Watchdog Load Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE</name>
          <description>Watchdog Value</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>WDT_VALUE</name>
              <description>Watchdog Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Watchdog Control</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>WDT_CTL_INTEN</name>
              <description>Watchdog Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WDT_CTL_RESEN</name>
              <description>Watchdog Reset Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Watchdog Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>WDT_ICR</name>
              <description>Watchdog Interrupt Clear</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Watchdog Raw Interrupt Status</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>WDT_RIS_WDTRIS</name>
              <description>Watchdog Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>Watchdog Masked Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>WDT_MIS_WDTMIS</name>
              <description>Watchdog Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>Watchdog Test</description>
          <addressOffset>0x00000418</addressOffset>
          <fields>
            <field>
              <name>WDT_TEST_STALL</name>
              <description>Watchdog Stall Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Watchdog Lock</description>
          <addressOffset>0x00000C00</addressOffset>
          <fields>
            <field>
              <name>WDT_LOCK</name>
              <description>Watchdog Lock</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDT_LOCK_UNLOCKED</name>
                  <description>Unlocked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_LOCK_LOCKED</name>
                  <description>Locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_PORTA</name>
      <description>Register map for GPIO_PORTA peripheral</description>
      <groupName>GPIO_PORT</groupName>
      <prependToName>GPIO_PORTA</prependToName>
      <baseAddress>0x40004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DATA</name>
          <description>GPIO Data</description>
          <addressOffset>0x000003FC</addressOffset>
        </register>
        <register>
          <name>DIR</name>
          <description>GPIO Direction</description>
          <addressOffset>0x00000400</addressOffset>
        </register>
        <register>
          <name>IS</name>
          <description>GPIO Interrupt Sense</description>
          <addressOffset>0x00000404</addressOffset>
        </register>
        <register>
          <name>IBE</name>
          <description>GPIO Interrupt Both Edges</description>
          <addressOffset>0x00000408</addressOffset>
        </register>
        <register>
          <name>IEV</name>
          <description>GPIO Interrupt Event</description>
          <addressOffset>0x0000040C</addressOffset>
        </register>
        <register>
          <name>IM</name>
          <description>GPIO Interrupt Mask</description>
          <addressOffset>0x00000410</addressOffset>
        </register>
        <register>
          <name>RIS</name>
          <description>GPIO Raw Interrupt Status</description>
          <addressOffset>0x00000414</addressOffset>
        </register>
        <register>
          <name>MIS</name>
          <description>GPIO Masked Interrupt Status</description>
          <addressOffset>0x00000418</addressOffset>
        </register>
        <register>
          <name>ICR</name>
          <description>GPIO Interrupt Clear</description>
          <addressOffset>0x0000041C</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>AFSEL</name>
          <description>GPIO Alternate Function Select</description>
          <addressOffset>0x00000420</addressOffset>
        </register>
        <register>
          <name>DR2R</name>
          <description>GPIO 2-mA Drive Select</description>
          <addressOffset>0x00000500</addressOffset>
        </register>
        <register>
          <name>DR4R</name>
          <description>GPIO 4-mA Drive Select</description>
          <addressOffset>0x00000504</addressOffset>
        </register>
        <register>
          <name>DR8R</name>
          <description>GPIO 8-mA Drive Select</description>
          <addressOffset>0x00000508</addressOffset>
        </register>
        <register>
          <name>ODR</name>
          <description>GPIO Open Drain Select</description>
          <addressOffset>0x0000050C</addressOffset>
        </register>
        <register>
          <name>PUR</name>
          <description>GPIO Pull-Up Select</description>
          <addressOffset>0x00000510</addressOffset>
        </register>
        <register>
          <name>PDR</name>
          <description>GPIO Pull-Down Select</description>
          <addressOffset>0x00000514</addressOffset>
        </register>
        <register>
          <name>SLR</name>
          <description>GPIO Slew Rate Control Select</description>
          <addressOffset>0x00000518</addressOffset>
        </register>
        <register>
          <name>DEN</name>
          <description>GPIO Digital Enable</description>
          <addressOffset>0x0000051C</addressOffset>
        </register>
        <register>
          <name>LOCK</name>
          <description>GPIO Lock</description>
          <addressOffset>0x00000520</addressOffset>
          <fields>
            <field>
              <name>GPIO_LOCK</name>
              <description>GPIO Lock</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_LOCK_UNLOCKED</name>
                  <description>The GPIOCR register is unlocked and may be modified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_LOCK_LOCKED</name>
                  <description>The GPIOCR register is locked and may not be modified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_LOCK_KEY</name>
                  <description>Unlocks the GPIO_CR register</description>
                  <value>0x1acce551</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>GPIO Commit</description>
          <addressOffset>0x00000524</addressOffset>
          <access>read-only</access>
        </register>
